
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Инструкция ="1.Создайте учетную запись на сайте ""https://home.openweathermap.org/"""
	            "2.Получите ключ API" 
				"3.Введите значение ключа в рекизит формы ""Ключ api"""; 
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоординатыНаСервере()
	Объект.Погода.Очистить();
	 Если  Объект.Город = ""   тогда
	Сообщение           = Новый СообщениеПользователю;
	Сообщение.Текст     = "Введите город!";
	Сообщение.Сообщить();	
	Возврат;	 
КонецЕсли; 

     Если  Объект.КлючAPI = ""   тогда
	Сообщение           = Новый СообщениеПользователю;
	Сообщение.Текст     = "Введите КлючAPI с сайта ""https://openweathermap.org/"" !";
	Сообщение.Сообщить();	
	Возврат;	 
	 КонецЕсли;

	 Город   = Объект.Город;
	 КлючAPI = Объект.КлючAPI;
Попытка
	ЗащищенноеСоединение = новый ЗащищенноеСоединениеOpenSSL();
	HTTPсоединение       = новый HTTPСоединение("api.openweathermap.org",443,,,,,ЗащищенноеСоединение);
    // Создаем HTTPЗапрос
	Заголовки  = Новый Соответствие;
    HTTPЗапрос = Новый HTTPЗапрос("/geo/1.0/direct?q="+Город+"&limit=5&appid="+КлючAPI,Заголовки);
	
	
	Ответ      = HTTPСоединение.Получить(HTTPЗапрос);       
    Если Ответ = Неопределено Тогда
		Сообщить("Ошибка" + Ответ.КодСостояния);
    КонецЕсли;
	
    Результат  = Ответ.ПолучитьТелоКакСтроку();
   	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат);  
    Данные     = ПрочитатьJSON(ЧтениеJSON,истина);        
		 
	Если Данные.Количество() = 0 Тогда
	     Сообщить("Город не найден!");
		  ЧтениеJSON.Закрыть();
	    Возврат;
	КонецЕсли;
        
    ПервыйРезультат = Данные[0];
    Объект.Страна   = ПервыйРезультат["country"];
	Объект.Широта   = ПервыйРезультат["lat"];
	Объект.Долгота  = ПервыйРезультат["lon"];     
        
    Исключение
    Сообщить("Ошибка: " + ОписаниеОшибки());
КонецПопытки; 

   КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКоординаты(Команда)
	ОчиститьСообщения(); 
	Элементы.СтраницаПогода.ТекущаяСтраница = Элементы.СтраницаПогода.ПодчиненныеЭлементы.Группа2;
	ПолучитьКоординатыНаСервере();
	Элементы.УзнатьПогоду.Доступность = Истина;
КонецПроцедуры

&НаСервере
Процедура УзнатьПогодуНаСервере()
	Если Объект.Долгота = 0 Тогда
	 Сообщение          = Новый СообщениеПользователю;
	 Сообщение.Текст    = "Сначала узнайте координаты города!";
	 Сообщение.Сообщить();
	Возврат;
КонецЕсли;
КлючApi = Объект.КлючAPI;
Попытка
	ЗащищенноеСоединение = новый ЗащищенноеСоединениеOpenSSL();
	HTTPсоединение = новый HTTPСоединение("api.openweathermap.org",443,,,,,ЗащищенноеСоединение);
    // Создаем HTTPЗапрос
	Заголовки  = Новый Соответствие;
    HTTPЗапрос = Новый HTTPЗапрос("/data/2.5/forecast?lat=" + Объект.Широта + "&lon=" + Объект.Долгота + "&appid=" + КлючApi+ "&units=metric&lang=ru",Заголовки);
	
    Ответ = HTTPСоединение.Получить(HTTPЗапрос); 
	Если Ответ.КодСостояния <> 200 Тогда
    Сообщить("Ошибка API: " + Ответ.КодСостояния + " - " + Ответ.ПолучитьТелоКакСтроку());
    Возврат;
    КонецЕсли; 

    ОтветСтрока = Ответ.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ОтветСтрока);
    Данные = ПрочитатьJSON(Чтение, Истина); // второй параметр — чтение в Соответствие/Массив
	 
	Для каждого Элемент Из Данные["list"] Цикл
    НоваяСтрока                         = Объект.Погода.Добавить();
	НоваяСтрока.Дата                    = Элемент["dt_txt"];
	НоваяСтрока.СкоростьВетра           = СтрШаблон("%1м/с",Элемент["wind"]["speed"]);
	НоваяСтрока.ВероятностьОсадков      = СтрШаблон("%1%%", Окр(Элемент["pop"] * 100, 0));                                                    //вероятность осадков в %
	НоваяСтрока.ТемператураПоОшущению   = СтрШаблон("%1°C", Элемент["main"]["feels_like"]);
    НоваяСтрока.Температура             = СтрШаблон("%1°C", Элемент["main"]["temp"]);                                                  
    НоваяСтрока.Влажность               = СтрШаблон("%1%%", Элемент["main"]["humidity"]);
	НоваяСтрока.облачность              = Элемент["weather"][0]["description"]; //облачность
	
	КонецЦикла;
	 Чтение.Закрыть(); 
    Исключение
    Сообщить("Ошибка при загрузке прогноза: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура УзнатьПогоду(Команда)
	Объект.Погода.Очистить();
	Элементы.СтраницаПогода.ТекущаяСтраница = Элементы.СтраницаПогода.ПодчиненныеЭлементы.Группа2;
	ОчиститьСообщения();
	УзнатьПогодуНаСервере();
	Элементы.УзнатьПогоду.Доступность = Ложь;
 Для Каждого Строка Из Объект.Погода Цикл
    Если СтрЗаканчиваетсяНа(Строка.Дата, "00:00:00") Тогда
        Строка.Пометка = Истина; 
    Иначе
        Строка.Пометка = Ложь;
	КонецЕсли;  
 КонецЦикла; 

 КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	Объект.Погода.Очистить();
	Объект.Широта  = "";
	Объект.Долгота = "";
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПароль(Команда)
	Если Элементы.КлючAPI.РежимПароля = Истина Тогда
    Элементы.КлючAPI.РежимПароля      = Ложь;
Иначе
    Элементы.КлючAPI.РежимПароля      = Истина;
КонецЕсли;
КонецПроцедуры

